In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

%matplotlib inline

In [2]:
df = pd.read_excel(r'C:\Users\vyshn\Desktop\DataScience-ML\Data Science Projects for Beginners\Classical-machine-learning-projects\Beginner projects\Dataset\fligh price\flight_price.xlsx')

In [3]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [5]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [6]:
df['Date'] = df['Date_of_Journey'].str.split('/').str[0].astype(int)
df['Month'] = df['Date_of_Journey'].str.split('/').str[1].astype(int)
df['Year'] = df['Date_of_Journey'].str.split('/').str[2].astype(int)

In [7]:
df.drop('Date_of_Journey', axis=1, inplace=True)

In [8]:
df['Month_sin'] = np.sin(2 * np.pi * df['Month']/12)
df['Month_cos'] = np.cos(2 * np.pi * df['Month']/12)

In [9]:
df.drop('Month', axis=1, inplace=True)

In [10]:
df['Arrival_Time'] = df['Arrival_Time'].apply(lambda x: x.split(' ')[0])
df['Arrival_hour'] = df['Arrival_Time'].str.split(':').str[0].astype(int)
df['Arrival_min'] = df['Arrival_Time'].str.split(':').str[1].astype(int)

df.drop('Arrival_Time', axis=1, inplace=True)

In [11]:
df['Dept_hour'] = df['Dep_Time'].str.split(':').str[0].astype(int)
df['Dept_min'] = df['Dep_Time'].str.split(':').str[1].astype(int)

df.drop('Dep_Time', axis=1, inplace=True)

In [12]:
df.drop('Route', axis=1, inplace=True)

In [13]:
df['duration_min'] = pd.to_timedelta(df['Duration']).dt.seconds //60

In [14]:
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Duration         10683 non-null  object
 4   Total_Stops      10682 non-null  object
 5   Additional_Info  10683 non-null  object
 6   Price            10683 non-null  int64
 7   Date             10683 non-null  int32
 8   Year             10683 non-null  int32
 9   Month_sin        10683 non-null  float64
 10  Month_cos        10683 non-null  float64
 11  Arrival_hour     10683 non-null  int32
 12  Arrival_min      10683 non-null  int32
 13  Dept_hour        10683 non-null  int32
 14  Dept_min         10683 non-null  int32
 15  duration_min     10683 non-null  int32
dtypes: float64(2), int32(7), int64(1), object(6)
memory usage: 1.0+ MB

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Year,Month_sin,Month_cos,Arrival_hour,Arrival_min,Dept_hour,Dept_min,duration_min
0,IndiGo,Banglore,New Delhi,2h 50m,non-stop,No info,3897,24,2019,1.0,6.123234e-17,1,10,22,20,170
1,Air India,Kolkata,Banglore,7h 25m,2 stops,No info,7662,1,2019,0.5,-8.660254e-01,13,15,5,50,445

In [15]:
df.drop('Duration', axis=1, inplace=True)

In [16]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [18]:
df['Total_Stops'] = df['Total_Stops'].map({'non-stop':4,
                                          '1 stop':3,
                                          '2 stops':2,
                                          '3 stops':1,
                                           '4 stops':0,
                                          np.nan:3,})

In [22]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [23]:
df['Source'].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [24]:
df['Destination'].unique()

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)

In [25]:
df['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [32]:
from sklearn.preprocessing import OneHotEncoder

# col = 

ohe = OneHotEncoder()
encoded = ohe.fit_transform(df[['Airline', 'Source', 'Destination','Additional_Info']]).toarray()

final_encoded = pd.DataFrame(encoded, columns=ohe.get_feature_names_out())

In [34]:
final_encoded.columns

Index(['Airline_Air Asia', 'Airline_Air India', 'Airline_GoAir',
       'Airline_IndiGo', 'Airline_Jet Airways', 'Airline_Jet Airways Business',
       'Airline_Multiple carriers',
       'Airline_Multiple carriers Premium economy', 'Airline_SpiceJet',
       'Airline_Trujet', 'Airline_Vistara', 'Airline_Vistara Premium economy',
       'Source_Banglore', 'Source_Chennai', 'Source_Delhi', 'Source_Kolkata',
       'Source_Mumbai', 'Destination_Banglore', 'Destination_Cochin',
       'Destination_Delhi', 'Destination_Hyderabad', 'Destination_Kolkata',
       'Destination_New Delhi', 'Additional_Info_1 Long layover',
       'Additional_Info_1 Short layover', 'Additional_Info_2 Long layover',
       'Additional_Info_Business class', 'Additional_Info_Change airports',
       'Additional_Info_In-flight meal not included',
       'Additional_Info_No Info',
       'Additional_Info_No check-in baggage included',
       'Additional_Info_No info', 'Additional_Info_Red-eye flight'],
      dtype='object')

In [36]:
df.drop(['Airline', 'Source', 'Destination','Additional_Info'], axis=1, inplace=True)

In [40]:
final_df = pd.concat([final_encoded, df], axis=1)

In [41]:
final_df.head(2)

,Airline_Air Asia,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Trujet,...,Price,Date,Year,Month_sin,Month_cos,Arrival_hour,Arrival_min,Dept_hour,Dept_min,duration_min
0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,3897,24,2019,1.0,6.123234e-17,1,10,22,20,170
1,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,7662,1,2019,0.5,-8.660254e-01,13,15,5,50,445

In [42]:
df.head()

,Total_Stops,Price,Date,Year,Month_sin,Month_cos,Arrival_hour,Arrival_min,Dept_hour,Dept_min,duration_min
0,4,3897,24,2019,1.000000e+00,6.123234e-17,1,10,22,20,170
1,2,7662,1,2019,5.000000e-01,-8.660254e-01,13,15,5,50,445
2,2,13882,9,2019,1.224647e-16,-1.000000e+00,4,25,9,25,1140
3,3,6218,12,2019,5.000000e-01,-8.660254e-01,23,30,18,5,325
4,3,13302,1,2019,1.000000e+00,6.123234e-17,21,35,16,50,285

In [44]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 44 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Airline_Air Asia                              10683 non-null  float64
 1   Airline_Air India                             10683 non-null  float64
 2   Airline_GoAir                                 10683 non-null  float64
 3   Airline_IndiGo                                10683 non-null  float64
 4   Airline_Jet Airways                           10683 non-null  float64
 5   Airline_Jet Airways Business                  10683 non-null  float64
 6   Airline_Multiple carriers                     10683 non-null  float64
 7   Airline_Multiple carriers Premium economy     10683 non-null  float64
 8   Airline_SpiceJet                              10683 non-null  float64
 9   Airline_Trujet                                10683 non-null  float64
 10  Airline_Vistara                               10683 non-null  float64
 11  Airline_Vistara Premium economy               10683 non-null  float64
 12  Source_Banglore                               10683 non-null  float64
 13  Source_Chennai                                10683 non-null  float64
 14  Source_Delhi                                  10683 non-null  float64
 15  Source_Kolkata                                10683 non-null  float64
 16  Source_Mumbai                                 10683 non-null  float64
 17  Destination_Banglore                          10683 non-null  float64
 18  Destination_Cochin                            10683 non-null  float64
 19  Destination_Delhi                             10683 non-null  float64
 20  Destination_Hyderabad                         10683 non-null  float64
 21  Destination_Kolkata                           10683 non-null  float64
 22  Destination_New Delhi                         10683 non-null  float64
 23  Additional_Info_1 Long layover                10683 non-null  float64
 24  Additional_Info_1 Short layover               10683 non-null  float64
 25  Additional_Info_2 Long layover                10683 non-null  float64
 26  Additional_Info_Business class                10683 non-null  float64
 27  Additional_Info_Change airports               10683 non-null  float64
 28  Additional_Info_In-flight meal not included   10683 non-null  float64
 29  Additional_Info_No Info                       10683 non-null  float64
 30  Additional_Info_No check-in baggage included  10683 non-null  float64
 31  Additional_Info_No info                       10683 non-null  float64
 32  Additional_Info_Red-eye flight                10683 non-null  float64
 33  Total_Stops                                   10683 non-null  int64
 34  Price                                         10683 non-null  int64
 35  Date                                          10683 non-null  int32
 36  Year                                          10683 non-null  int32
 37  Month_sin                                     10683 non-null  float64
 38  Month_cos                                     10683 non-null  float64
 39  Arrival_hour                                  10683 non-null  int32
 40  Arrival_min                                   10683 non-null  int32
 41  Dept_hour                                     10683 non-null  int32
 42  Dept_min                                      10683 non-null  int32
 43  duration_min                                  10683 non-null  int32
dtypes: float64(35), int32(7), int64(2)
memory usage: 3.3 MB

### Perform XGB on the following dataset (final_df); will be a practice

In [45]:
!pip install XGBoost

Requirement already satisfied: XGBoost in c:\users\vyshn\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy in c:\users\vyshn\anaconda3\lib\site-packages (from XGBoost) (1.26.4)
Requirement already satisfied: scipy in c:\users\vyshn\anaconda3\lib\site-packages (from XGBoost) (1.13.1)

In [46]:
from xgboost import XGBRegressor

In [ ]:
xgb_model = xgb_model()